package com.basics.learning.lesson_04;

/**
 * А что это за зеленые строки кода?
 * Это комментарии.
 * Здесь можно описывать, что делает программа,
 * чтобы другие программисты могли прочитать
 * и воспользоваться ей.
 *
 * А еще можно писать, кто ее автор:
 * @author Lyubov
 */
public class Main {
    public static void main(String[] args) {
        //А еще бываю такие комментарии

        /* И такие
        * Смотри-ка они серые!
        * А в чем отличие от зеленых?
        * Зеленые принято писать сверху, а серые для небольших объяснений
        * по ходу работы программы.
        *
        *
        * */
    }
}
